# 1-Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_data,index=labels)
#or
#pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [6]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [9]:
ser1=pd.Series([1,2,3,4],['US','IR','DE','FR'])
ser2=pd.Series([1,2,5,4],['US','IR','IT','FR'])

In [10]:
ser1

US    1
IR    2
DE    3
FR    4
dtype: int64

In [11]:
ser2

US    1
IR    2
IT    5
FR    4
dtype: int64

In [12]:
ser2['US']

1

In [13]:
ser2['IT']

5

In [14]:
ser1+ser2

DE    NaN
FR    8.0
IR    4.0
IT    NaN
US    2.0
dtype: float64

# 2-dataframe

In [43]:
import numpy as np
import pandas as pd

In [44]:
from numpy.random import randn

In [45]:
np.random.seed(101)

In [46]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [47]:
df
#or
df.head(3)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [48]:
#indexing and selection

In [49]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [50]:
type(df['W'])

pandas.core.series.Series

In [51]:
type(df)

pandas.core.frame.DataFrame

In [52]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [53]:
df['new']=df['W']+df['X']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [54]:
#column drop
df.drop('new',axis=1)
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [55]:
#to replace
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
#row drop
df.drop('E')
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
#df.drop('E',inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [59]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [60]:
df.loc['B','Y']

-0.8480769834036315

In [61]:
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [62]:
#conditional selection

In [63]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
#multiple conditional selection

In [65]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [66]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [67]:
#more indexing details

In [68]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [69]:
#permanent
#df.reset_index(inplace=True)

In [70]:
newind='CA NY WY OR CO'.split()

In [71]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [72]:
df['State']=newind
df

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

In [74]:
df.set_index('State',inplace=True)
df

              W         X         Y         Z
State
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

In [75]:
df_hw1=pd.DataFrame(randn(6,5), ['IR','EN','DE','NY','FR','US'],['A','B','C','D','E'])

In [76]:
df_hw1

           A         B         C         D         E
IR  0.302665  1.693723 -1.706086 -1.159119 -0.134841
EN  0.390528  0.166905  0.184502  0.807706  0.072960
DE  0.638787  0.329646 -0.497104 -0.754070 -0.943406
NY  0.484752 -0.116773  1.901755  0.238127  1.996652
FR -0.993263  0.196800 -1.136645  0.000366  1.025984
US -0.156598 -0.031579  0.649826  2.154846 -0.610259

In [78]:
df_hw1[['B','D']]

           B         D
IR  1.693723 -1.159119
EN  0.166905  0.807706
DE  0.329646 -0.754070
NY -0.116773  0.238127
FR  0.196800  0.000366
US -0.031579  2.154846

In [79]:
df_hw1['AD']=df_hw1['A']+df_hw1['D']

In [80]:
df_hw1

           A         B         C         D         E        AD
IR  0.302665  1.693723 -1.706086 -1.159119 -0.134841 -0.856454
EN  0.390528  0.166905  0.184502  0.807706  0.072960  1.198234
DE  0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.115283
NY  0.484752 -0.116773  1.901755  0.238127  1.996652  0.722879
FR -0.993263  0.196800 -1.136645  0.000366  1.025984 -0.992897
US -0.156598 -0.031579  0.649826  2.154846 -0.610259  1.998249

In [81]:
df_hw1.drop('AD',axis=1,inplace=True)

In [82]:
df_hw1

           A         B         C         D         E
IR  0.302665  1.693723 -1.706086 -1.159119 -0.134841
EN  0.390528  0.166905  0.184502  0.807706  0.072960
DE  0.638787  0.329646 -0.497104 -0.754070 -0.943406
NY  0.484752 -0.116773  1.901755  0.238127  1.996652
FR -0.993263  0.196800 -1.136645  0.000366  1.025984
US -0.156598 -0.031579  0.649826  2.154846 -0.610259

In [84]:
df_hw1.loc[['EN','DE'],['B','D']]

           B         D
EN  0.166905  0.807706
DE  0.329646 -0.754070

In [85]:
df_hw1[df_hw1['C']>0]

           A         B         C         D         E
EN  0.390528  0.166905  0.184502  0.807706  0.072960
NY  0.484752 -0.116773  1.901755  0.238127  1.996652
US -0.156598 -0.031579  0.649826  2.154846 -0.610259

# 3- missing Data

In [15]:
import numpy as np
import pandas as pd

In [16]:
d={'A':[1,2,np.nan,3],'B':[4,np.nan,np.nan,5],'C':[6,7,8,9]}

In [17]:
df=pd.DataFrame(d)

In [18]:
df

     A    B  C
0  1.0  4.0  6
1  2.0  NaN  7
2  NaN  NaN  8
3  3.0  5.0  9

In [19]:
df.dropna()

     A    B  C
0  1.0  4.0  6
3  3.0  5.0  9

In [20]:
df.dropna(axis=1)

   C
0  6
1  7
2  8
3  9

In [21]:
df.dropna(thresh=2)

     A    B  C
0  1.0  4.0  6
1  2.0  NaN  7
3  3.0  5.0  9

In [22]:
df.fillna(value=10)

      A     B  C
0   1.0   4.0  6
1   2.0  10.0  7
2  10.0  10.0  8
3   3.0   5.0  9

In [23]:
df.fillna(value='missing')

         A        B  C
0        1        4  6
1        2  missing  7
2  missing  missing  8
3        3        5  9

In [24]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    2.0
3    3.0
Name: A, dtype: float64

# 4-Operations

In [6]:
import numpy as np
import pandas as pd

In [9]:
data={'Company':['Facebook','Amazon','Google','Amazon','Google','Facebook','Amazon'],
       'person':['john','anita','sarah','shadi','pedram','leila','hamid'],
      'sale':[100,200,300,400,500,600,700]}

In [10]:
df=pd.DataFrame(data)
df

    Company  person  sale
0  Facebook    john   100
1    Amazon   anita   200
2    Google   sarah   300
3    Amazon   shadi   400
4    Google  pedram   500
5  Facebook   leila   600
6    Amazon   hamid   700

In [11]:
df.groupby('Company').sum()

          sale
Company
Amazon    1300
Facebook   700
Google     800

In [12]:
df.groupby('Company').min()

          person  sale
Company
Amazon     anita   200
Facebook    john   100
Google    pedram   300

In [13]:
df.groupby('Company',sort=False).sum()

          sale
Company
Facebook   700
Amazon    1300
Google     800

In [14]:
df.groupby('Company').sum().loc['Facebook']

sale    700
Name: Facebook, dtype: int64

In [15]:
df.groupby('Company').count()

          person  sale
Company
Amazon         3     3
Facebook       2     2
Google         2     2

In [16]:
df.groupby('Company').describe()

          sale
         count        mean         std    min    25%    50%    75%    max
Company
Amazon     3.0  433.333333  251.661148  200.0  300.0  400.0  550.0  700.0
Facebook   2.0  350.000000  353.553391  100.0  225.0  350.0  475.0  600.0
Google     2.0  400.000000  141.421356  300.0  350.0  400.0  450.0  500.0

In [18]:
df['Company'].unique()

array(['Facebook', 'Amazon', 'Google'], dtype=object)

In [20]:
df['Company'].nunique()
#or
#len(df['Company'].unique())

3

In [21]:
df['Company'].value_counts()

Amazon      3
Facebook    2
Google      2
Name: Company, dtype: int64

In [22]:
def times2(x):
    return x*2

In [24]:
df['sale'].apply(times2)

0     200
1     400
2     600
3     800
4    1000
5    1200
6    1400
Name: sale, dtype: int64

In [25]:
df['sale'].apply(lambda x:x*2)

0     200
1     400
2     600
3     800
4    1000
5    1200
6    1400
Name: sale, dtype: int64

In [26]:
df.sort_values('sale')

    Company  person  sale
0  Facebook    john   100
1    Amazon   anita   200
2    Google   sarah   300
3    Amazon   shadi   400
4    Google  pedram   500
5  Facebook   leila   600
6    Amazon   hamid   700

In [27]:
df.sort_values('sale', ascending=False)

    Company  person  sale
6    Amazon   hamid   700
5  Facebook   leila   600
4    Google  pedram   500
3    Amazon   shadi   400
2    Google   sarah   300
1    Amazon   anita   200
0  Facebook    john   100